docs/representacion/03-diagrama-vocabulario/posicion/uml-secuencia.assets/conectar.spec2viz-plantuml-defecto.puml
@startuml
actor Usuario
participant Front
participant ServePy
participant PronVerbs
boundary SldbStore

Usuario -> Front: arrastra Table hacia Bookable con Realización
Front -> ServePy: POST operación connect(realizes, table, bookable)
ServePy -> PronVerbs: assert_edge(realizes, table, bookable)
PronVerbs -> SldbStore: find UmlClass donde kind = interface
SldbStore <-- PronVerbs: bookable
PronVerbs -> SldbStore: create RelationDoc
PronVerbs <-- ServePy: realizes--UmlClass:table--UmlClass:bookable
ServePy <-- Front: grafo regenerado
@enduml
